Repository: Archaofan/UpstreamLens
Catalog: Sources/App/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld items will move to handled records; this means you have finished reviewing them locally.
zh_hans: 共 %lld 条将进入已处理记录；这表示你已完成本地核查。

source: %lld sources
zh_hans: %lld 个来源

source: %lld unread
zh_hans: 其中 %lld 条未读

source: %lld upstream items were published at once; listed as one summary item to avoid flooding the list.
zh_hans: 上游一次发布了 %lld 个条目；为避免刷屏，合并为一条摘要。

source: %lld upstream updates at once
zh_hans: 一次 %lld 条上游更新

source: (prerelease)
zh_hans: （预发布）

source: 15 min
zh_hans: 15 分钟

source: 3 hours
zh_hans: 3 小时

source: 30 min
zh_hans: 30 分钟

source: 60 min
zh_hans: 60 分钟

source: AI & LLM
zh_hans: AI 与大模型

source: AI Search Prompt
zh_hans: AI 检索提示词

source: AI Search Prompt (one-tap copy)
zh_hans: AI 检索提示词（一键复制）

source: About
zh_hans: 关于

source: About & Diagnostics
zh_hans: 关于与诊断

source: Action Failed
zh_hans: 操作失败

source: Actions
zh_hans: 操作

source: Add
zh_hans: 添加

source: Add & Organize
zh_hans: 添加与整理

source: Add Source
zh_hans: 添加来源

source: Add Sources
zh_hans: 添加来源

source: Add Your First Watch Source
zh_hans: 添加第一个监控来源

source: Add a repo in the Sources tab; the first successful check sets the baseline.
zh_hans: 在「来源」页添加仓库；首次成功检查只建立基线。

source: Add a repo to start tracking its releases.
zh_hans: 添加一个仓库，开始跟踪它的版本发布。

source: Added %lld sources, skipped %lld duplicates.
zh_hans: 已新增 %lld 个来源，跳过 %lld 个重复项。

source: Adding purpose, keywords, and the version in use improves accuracy.
zh_hans: 补充用途、关键词和使用版本后，判断会更准。

source: After generating, copy the token, return to Settings, paste it, and tap “Sign In and Verify”.
zh_hans: 生成后复制令牌，回到设置页粘贴并点“登录并验证”。

source: All
zh_hans: 全部

source: Alternate icons are installed with the app. The system may briefly show a notification while switching. This preference stays on this device and is never included in backups.
zh_hans: 备用图标随 App 一起安装。切换时系统可能会短暂弹出提示。此偏好仅保存在本机，不会包含在备份中。

source: Amber
zh_hans: 琥珀

source: App Icon
zh_hans: App 图标

source: Appearance
zh_hans: 外观

source: Appearance preferences stay on this device and are never included in backups.
zh_hans: 外观偏好仅保存在本机，不会包含在备份中。

source: Assessment
zh_hans: 判断

source: Assigned categories to %lld sources.
zh_hans: 已为 %lld 个来源分配类别。

source: Authorized
zh_hans: 已授权

source: Auto-Categorize Unassigned Sources
zh_hans: 自动归类未分类来源

source: Auto-categorization only fills sources that have no category yet; it never overwrites your own choice.
zh_hans: 自动归类只填充尚未分类的来源，不会覆盖你自己的选择。

source: Auto-clear handled records older than 90 days
zh_hans: 自动清理 90 天前的已处理记录

source: Back
zh_hans: 上一步

source: Background Brightness
zh_hans: 背景亮度

source: Background Opacity
zh_hans: 背景不透明度

source: Background Refresh
zh_hans: 后台刷新

source: Background checks are scheduled by iOS roughly every 30 minutes and are not guaranteed to be real-time.
zh_hans: 后台检查由 iOS 调度，约每 30 分钟起，不能保证实时。

source: Background checks are scheduled by iOS roughly every 30 minutes — not real-time pushes.
zh_hans: 后台检查由 iOS 调度，大约每 30 分钟一次，不是实时推送。

source: Blue
zh_hans: 蓝色

source: Branch
zh_hans: 分支

source: Branch (empty = default branch)
zh_hans: 分支（留空使用默认分支）

source: Cancel
zh_hans: 取消

source: Cannot generate a comparison (identical or missing content).
zh_hans: 无法生成对照（内容相同或缺失）。

source: Categories
zh_hans: 类别管理

source: Categories, Search & Tags
zh_hans: 类别、搜索与标签

source: Category
zh_hans: 类别

source: Category name
zh_hans: 类别名称

source: Change Content
zh_hans: 变化内容

source: Change Details
zh_hans: 变化详情

source: Changes
zh_hans: 变化

source: Check This Source
zh_hans: 检查此来源

source: Check for Updates on Open
zh_hans: 打开时检查更新

source: Checking
zh_hans: 正在检查

source: Choose Background Image
zh_hans: 选择背景图片

source: Choose from upstream…
zh_hans: 从上游选择…

source: Clear
zh_hans: 清理

source: Clear All (including existing sources' avatars)
zh_hans: 清除全部（含已有来源的头像）

source: Clear Icon Cache
zh_hans: 清除图标缓存

source: Clear Selection
zh_hans: 清除已选版本

source: Clear handled records now (%lld)
zh_hans: 立即清空已处理记录（%lld）

source: Clear handled records?
zh_hans: 清理已处理记录？

source: Clear icon cache?
zh_hans: 清除图标缓存？

source: Clipboard content is not a recognized GitHub repository link.
zh_hans: 剪贴板内容无法识别为 GitHub 仓库链接。

source: Close
zh_hans: 关闭

source: Collapse
zh_hans: 收起

source: Commit SHA in use (optional)
zh_hans: 正在使用的提交 SHA（可留空）

source: Confirm Source
zh_hans: 确认来源

source: Content Readability Shade
zh_hans: 内容可读性压暗

source: Continue adding %@
zh_hans: 继续添加 %@

source: Copy All
zh_hans: 复制全部

source: Copy the prompt to an AI that can access your machine; it searches the open-source projects you use and outputs a JSON list. Save the list as a .json file and import it here; the app merges new sources and checks immediately. Existing sources are never overwritten or modified.
zh_hans: 把提示词复制给能访问本机的 AI，它会检索你在用的开源项目并输出 JSON 清单；清单保存为 .json 后从这里导入，App 会合并新增来源并立即检查。不会覆盖或修改已有来源。

source: Copy this to an AI that can access your machine (e.g. an Agent CLI or IDE assistant); save the JSON it returns as a .json file, then use “Import AI Source List” to add it to monitoring.
zh_hans: 复制给能访问你电脑/服务器的 AI（如 Agent CLI、IDE 助手）；它返回的 JSON 存为 .json 文件后，用“导入 AI 来源清单”加入监控。

source: Could not read local data, so saving is paused to protect the original file. Import a valid backup: {detail}
zh_hans: 无法读取本地数据，已暂停保存以保护原文件。请导入有效备份：{detail}

source: Current background
zh_hans: 当前背景

source: Custom Background
zh_hans: 自定义背景

source: Data
zh_hans: 数据

source: Data & Backup
zh_hans: 数据与备份

source: Data & Storage
zh_hans: 数据与存储

source: Data Stays On-Device
zh_hans: 数据只留在本机

source: Delete Source
zh_hans: 删除来源

source: Denied (enable in System Settings)
zh_hans: 已被拒绝（请到系统设置开启）

source: Dev Tools
zh_hans: 开发工具

source: Developer
zh_hans: 开发者

source: Diagnostics
zh_hans: 诊断

source: Dismiss
zh_hans: 忽略

source: Display Name
zh_hans: 显示名称

source: Done
zh_hans: 完成

source: Edit Usage
zh_hans: 编辑使用情况

source: Edit Watch Target
zh_hans: 编辑监控目标

source: Emerald
zh_hans: 翠绿

source: Enter Manually
zh_hans: 手动填写

source: Enter Manually…
zh_hans: 手动输入…

source: Enter or select a path to monitor.
zh_hans: 请填写或选择要监控的路径。

source: Enter the file or directory path to monitor.
zh_hans: 请填写要监控的文件或目录路径。

source: Every source already has a category, or nothing could be inferred.
zh_hans: 所有来源都已有类别，或无法推断出任何类别。

source: Export JSON Backup
zh_hans: 导出 JSON 备份

source: Exported backups include personal usage info; importing replaces all existing data.
zh_hans: 导出备份会包含个人使用信息；导入会替换全部现有数据。

source: Failed to list paths
zh_hans: 路径枚举失败

source: Failed to load upstream versions
zh_hans: 上游版本列表读取失败

source: File Comparison
zh_hans: 文件对照

source: File change: about %lld lines added, %lld lines removed.
zh_hans: 文件变化：新增约 %lld 行，删除约 %lld 行。

source: Filter Changes
zh_hans: 筛选变化

source: Follow System
zh_hans: 跟随系统

source: Found At
zh_hans: 发现时间

source: General
zh_hans: 通用

source: Generate Diagnostics
zh_hans: 生成诊断信息

source: Generate detailed info in Settings → Diagnostics and send it to the developer.
zh_hans: 可在“设置 → 诊断”生成详细信息并发给开发者。

source: Get Started
zh_hans: 开始使用

source: Getting Started
zh_hans: 使用引导

source: GitHub API Rate Limit
zh_hans: GitHub API 限额

source: GitHub API quota is shown after a check completes.
zh_hans: 完成一次检查后显示 GitHub API 剩余额度。

source: GitHub Repository
zh_hans: GitHub 仓库

source: GitHub Sign-In
zh_hans: GitHub 登录

source: GitHub Source
zh_hans: GitHub 来源

source: Green
zh_hans: 绿色

source: Group By
zh_hans: 分组方式

source: Handled
zh_hans: 已处理

source: Handled Records
zh_hans: 已处理记录

source: Handled records will be permanently deleted. To keep them, export a JSON backup first.
zh_hans: 已处理记录会被永久删除。如需保留，请先导出 JSON 备份。

source: Help · Batch-add sources with AI
zh_hans: 帮助 · 用 AI 批量添加来源

source: High-star AI projects and agent toolchains; tap to prefill.
zh_hans: AI 领域高星项目与 Agent 工具链，点选即预填。

source: How to Create a Token
zh_hans: 如何创建令牌

source: How to create a token?
zh_hans: 如何创建令牌？

source: Icon
zh_hans: 图标

source: Icon Cache
zh_hans: 图标缓存

source: Icon Cache Size
zh_hans: 图标缓存大小

source: Icon Switch Failed
zh_hans: 图标切换失败

source: Icon cache cleared
zh_hans: 图标缓存已清除

source: Import AI Source List (merge into existing sources)
zh_hans: 导入 AI 来源清单（合并到现有来源）

source: Import Complete
zh_hans: 导入完成

source: Import JSON Backup (replace existing data)
zh_hans: 导入 JSON 备份（替换现有数据）

source: Import a valid JSON backup in Settings → Data before adding sources.
zh_hans: 请在“设置 → 数据”中导入有效的 JSON 备份，再添加来源。

source: Import failed
zh_hans: 导入失败

source: Includes App Group, signing profile, storage, and rate-limit status. If the widget shows “Shared data unavailable”, send the generated text to the developer.
zh_hans: 包含 App Group、签名 profile、存储与限额状态。小组件显示“共享数据暂不可用”时，请把生成的文本发给开发者。

source: Indigo
zh_hans: 靛蓝

source: Interval
zh_hans: 间隔

source: Judgments are based on the purpose, version, and keywords you record for each source.
zh_hans: 判断依据是你为每个来源填写的用途、使用版本与关键词。

source: Keep existing sources' avatars, clear the rest
zh_hans: 保留已有来源的头像，清除其余

source: Keywords
zh_hans: 关键词

source: Keywords to watch, comma-separated
zh_hans: 关注关键词，逗号分隔

source: Keywords to watch, comma-separated (optional)
zh_hans: 关注关键词，逗号分隔（可选）

source: Language
zh_hans: 语言

source: Last Check
zh_hans: 上次检查

source: Last check: %@
zh_hans: 上次检查：%@

source: Last successful check: %@
zh_hans: 上次成功检查：%@

source: Latest Upstream Version
zh_hans: 上游最新版本

source: Load Upstream Versions
zh_hans: 读取上游版本列表

source: Loading upstream versions…
zh_hans: 正在读取上游版本…

source: Make It Yours
zh_hans: 让它变成你的

source: Mark All as Handled
zh_hans: 全部标为已处理

source: Mark All as Read
zh_hans: 全部标为已读

source: Mark all pending changes as handled?
zh_hans: 把待处理变化全部标为已处理？

source: Mark as Handled
zh_hans: 标为已处理

source: Mark as Unread
zh_hans: 标为未读

source: Merge Import
zh_hans: 合并导入

source: Merge import source list?
zh_hans: 合并导入来源清单？

source: Mint
zh_hans: 薄荷

source: Mode
zh_hans: 模式

source: Monitoring & Refresh
zh_hans: 监控与刷新

source: Monitoring Method
zh_hans: 监控方式

source: Monitoring Paused
zh_hans: 监控已暂停

source: Monitoring public repos needs no GitHub sign-in.
zh_hans: 监控公开仓库无需登录 GitHub。

source: More Actions
zh_hans: 更多操作

source: More Personal Info (optional)
zh_hans: 更多个人信息（可选）

source: My Usage
zh_hans: 我的使用情况

source: My Usage (stored on this device only)
zh_hans: 我的使用情况（仅保存在本机）

source: My Usage (stored on this device only, can add later)
zh_hans: 我的使用情况（仅保存在本机，可稍后补充）

source: Name
zh_hans: 名称

source: Network & Proxy
zh_hans: 网络与代理

source: New category name
zh_hans: 新类别名称

source: New changes appear here after you add sources
zh_hans: 添加来源后，新变化会显示在这里

source: Next
zh_hans: 下一步

source: No description provided upstream.
zh_hans: 上游未提供说明。

source: No handled records
zh_hans: 暂无已处理记录

source: No key changes right now; switch to “All” to view
zh_hans: 暂无重点变化；可切回“全部”查看

source: No matches, or press Return after typing.
zh_hans: 没有匹配结果，或输入完成后回车搜索。

source: No matching SKILL.md files found in the repo; enter the path manually.
zh_hans: 仓库中没有找到匹配 SKILL.md 的文件，请手动输入路径。

source: No matching sources
zh_hans: 没有匹配的来源

source: No new changes yet; the first check only sets a baseline.
zh_hans: 暂无新变化；首次检查只建立基线。

source: No pending changes right now
zh_hans: 目前没有待处理变化

source: No sources yet
zh_hans: 暂无来源

source: No unread changes
zh_hans: 没有未读变化

source: No upstream Release / Tag
zh_hans: 上游暂无 Release／Tag

source: No usage recorded, so the personal impact cannot be judged. Check the upstream original.
zh_hans: 未填写使用情况，无法判断个人影响；请查看上游原文。

source: Not Checked
zh_hans: 未查询

source: Not Determined
zh_hans: 待确认

source: Not signed in: uses the public limit (about 60/hour per IP). Sign in to lift the limit and support private repos; the app works fine without it.
zh_hans: 未登录：使用公开限额（约 60 次/小时）。登录后解除限制并支持私有仓库；不登录也能正常用。

source: Nothing matched your recorded keywords or purpose; you can still read the upstream original.
zh_hans: 未匹配你记录的关键词或用途；仍可查看上游原文。

source: Notifications
zh_hans: 通知

source: Notifications & Widget
zh_hans: 通知与小组件

source: Notifications Off for This Source
zh_hans: 此来源的通知已关闭

source: Notify on New Changes
zh_hans: 新变化通知

source: OK
zh_hans: 确定

source: Only Version-Like Releases
zh_hans: 只关注版本号形式的发布

source: Only locally cached repository avatar images are deleted. Sources, settings, change records, and backups are never touched. Avatars you keep re-download the next time you view them.
zh_hans: 只会删除本机缓存的仓库头像图片。来源、设置、变化记录和备份都不会被触碰。保留的头像会在下次查看时重新下载。

source: Only “Worth Attention” and “Uncertain Impact” changes are notified (each source can be turned off individually). “Worth Attention” shows a banner; the rest enter Notification Center silently; whether it interrupts is decided by the system Focus mode. Background checks are scheduled by iOS roughly every 30 minutes and are not guaranteed to be real-time.
zh_hans: 只通知“值得关注”与“影响不确定”的相关变化（每个来源可单独关闭）。“值得关注”会横幅提醒，其余静默进入通知中心；是否打断由系统的专注模式决定。后台检查由 iOS 调度，约每 30 分钟起，不能保证实时。

source: Open GitHub Token Creation Page
zh_hans: 打开 GitHub 令牌创建页

source: Open the “Fine-grained personal access token” creation page on GitHub (the button below goes straight there).
zh_hans: 在 GitHub 打开“Fine-grained personal access token”创建页（下方按钮直达）。

source: Orange
zh_hans: 橙色

source: Other
zh_hans: 其他

source: Other Ways
zh_hans: 其他方式

source: Owner
zh_hans: 作者

source: Owners who publish content-addressed snapshots can be filtered so only version-like releases are reported.
zh_hans: 对于会把内容寻址快照也发成 release 的上游，可以开启过滤，只报告看起来像版本号的发布。

source: Path
zh_hans: 路径

source: Path, e.g. skills/example/SKILL.md
zh_hans: 路径，如 skills/example/SKILL.md

source: Pause Monitoring
zh_hans: 暂停监控

source: Paused
zh_hans: 已暂停

source: Pending Changes
zh_hans: 待处理变化

source: Permissions needed: Metadata → Read-only, Contents → Read-only. To monitor private repos, add those repos to the token's repository access scope.
zh_hans: 权限只需：Metadata → Read-only，Contents → Read-only。要监控私有仓库时，把对应仓库加进令牌的仓库访问范围。

source: Pick an accent theme, choose an alternate app icon, and set a photo as the page background with adjustable opacity, brightness and readability. All of it lives in Settings → General.
zh_hans: 可以挑选强调色主题、更换 App 图标，还能用照片做页面背景，并调节透明度、亮度与可读性压暗。这些都在「设置 → 通用」里。

source: Pink
zh_hans: 粉色

source: Plus {count} more related change(s); open the app to review.
zh_hans: 还有 {count} 条相关变化，打开 App 查看。

source: Possible GitHub link in clipboard
zh_hans: 剪贴板里可能有 GitHub 链接

source: Prerelease
zh_hans: 预发布

source: Probing uses up to 2 requests plus 1 for the version list; subsequent checks with no changes don't count against the limit.
zh_hans: 探测最多 2 次、版本列表 1 次 GitHub API 请求；未变化时的后续检查不计入限额。

source: Project Home
zh_hans: 项目主页

source: Purple
zh_hans: 紫色

source: Purpose
zh_hans: 用途

source: Purpose, e.g. NAS remote access
zh_hans: 用途，例如 NAS 远程连接

source: Purpose, version, keywords, and other personal info stay on your phone and are never sent to GitHub. Export JSON to back up or migrate anytime.
zh_hans: 用途、版本、关键词等个人信息只存在你的手机上，绝不会发往 GitHub。随时可以导出 JSON 做备份或迁移。

source: Radar
zh_hans: 雷达

source: Read
zh_hans: 已读

source: Reading repo info…
zh_hans: 正在读取仓库信息…

source: Rebuild Baseline
zh_hans: 重建当前基线

source: Recommend UpstreamLens to a friend
zh_hans: 把 UpstreamLens 推荐给朋友

source: Records
zh_hans: 记录

source: Refresh Now
zh_hans: 手动刷新

source: Remaining This Hour
zh_hans: 本小时剩余额度

source: Remove Background Image
zh_hans: 移除背景图片

source: Replace Background Image
zh_hans: 更换背景图片

source: Replace Existing Data
zh_hans: 替换现有数据

source: Replace existing data?
zh_hans: 替换现有数据？

source: Repo Detected
zh_hans: 识别到仓库

source: Repository
zh_hans: 仓库

source: Repository avatars are cached on disk so lists stay fast. Clearing only deletes these cached images: sources, settings, change records, and backups are never touched.
zh_hans: 仓库头像会缓存在磁盘上以保持列表流畅。清除只会删除这些缓存图片：来源、设置、变化记录和备份都不会被触碰。

source: Restore Local Data First
zh_hans: 请先恢复本地数据

source: Retry from Upstream Versions
zh_hans: 重试从上游版本列表选择

source: Return to Pending
zh_hans: 重新加入待处理

source: Rose
zh_hans: 玫红

source: Routine Update
zh_hans: 一般更新

source: Save
zh_hans: 保存

source: Save and Set Baseline
zh_hans: 保存并建立基线

source: Saving failed and the last saved data was restored: {detail}
zh_hans: 保存失败，已恢复上次保存的数据：{detail}

source: Search Results
zh_hans: 搜索结果

source: Search a repo name or paste a GitHub link. Presets add starred AI projects in one tap. When filling in the version in use, pick straight from the upstream release list.
zh_hans: 搜索仓库名或粘贴 GitHub 链接即可添加。预设可以一键加入热门 AI 项目。填写「使用版本」时可以直接从上游发布列表里选。

source: Search a repo name or paste a GitHub link; the first successful check sets the baseline.
zh_hans: 搜索仓库名或粘贴 GitHub 链接即可；首次成功检查会建立当前基线。

source: Search a repo name, or paste a GitHub link
zh_hans: 搜索仓库名，或粘贴 GitHub 链接

source: Search failed
zh_hans: 搜索失败

source: Search sources
zh_hans: 搜索来源

source: Search title, content, or source
zh_hans: 搜索标题、内容或来源

source: Searching…
zh_hans: 正在搜索…

source: Self-Hosted
zh_hans: 自托管

source: Separate with commas or spaces. Tags are stored on this device and used to filter the Sources tab.
zh_hans: 用逗号或空格分隔。标签仅保存在本机，用于在「来源」页筛选。

source: Settings
zh_hans: 设置

source: Show All %lld Lines
zh_hans: 显示全部 %lld 行

source: Sign In and Verify
zh_hans: 登录并验证

source: Sign Out
zh_hans: 登出

source: Signed In
zh_hans: 已登录

source: Signed in: uses the authenticated limit (about 5000/hour) and can monitor private repos. The token is stored only in the local Keychain.
zh_hans: 已登录：使用 authenticated 限额（约 5000 次/小时），并可监控私有仓库。令牌仅存本机 Keychain。

source: Skip
zh_hans: 跳过

source: Source
zh_hans: 来源

source: Source list import failed
zh_hans: 来源清单导入失败

source: Sources
zh_hans: 来源

source: Sources are grouped by category on the Sources tab. Deleting a category moves its sources to “Other”; it never deletes a source.
zh_hans: 来源页会按类别分组。删除类别只会把其中的来源移到「其他」，绝不会删除来源本身。

source: Status
zh_hans: 状态

source: Suggested Presets
zh_hans: 常用预设

source: Supports github.com repo, branch, and file links, or type owner/repo directly.
zh_hans: 支持 github.com 仓库、分支、文件链接，或直接输入 owner/repo。

source: Switch to Manual Entry
zh_hans: 改为手动填写

source: System Authorization
zh_hans: 系统授权状态

source: Tags
zh_hans: 标签

source: Tags, e.g. self-hosted, NAS, AI
zh_hans: 标签，例如 自托管、NAS、AI

source: Teal
zh_hans: 青色

source: The Sources tab groups your repos by category and lets you search by name, purpose or tag. Categories are yours to edit in Settings → Categories.
zh_hans: 「来源」页按类别分组，并支持按名称、用途或标签搜索。类别可以在「设置 → 类别管理」里自由增删改。

source: The app defaults to English. You can switch to Simplified Chinese or follow the system language anytime.
zh_hans: 应用默认英文。你可以随时切换到简体中文，或跟随系统语言。

source: The backup contains %lld sources and %lld records; importing will replace your current %lld sources.
zh_hans: 备份中包含 %lld 个来源、%lld 条记录，导入后将替换现有的 %lld 个来源。

source: The change mentions your recorded purpose or rationale “{terms}”.
zh_hans: 变更提及你记录的用途或理由「{terms}」。

source: The change mentions your watched keyword(s) “{terms}”. Check the original wording against how you use it.
zh_hans: 变更提及你关注的关键词「{terms}」。请核对原文与当前用途。

source: The change mentions “{term}”, which usually signals a compatibility or security impact. Check the original wording against how you use it.
zh_hans: 变更包含「{term}」，通常涉及兼容性或安全，请核对原文与当前用途。

source: The first successful check only sets a baseline; new changes are reported after that.
zh_hans: 首次成功检查只建立基线，之后的检查才会报告新变化。

source: The first successful check only sets a baseline; old versions are not treated as new changes.
zh_hans: 首次成功检查只建立基线，不会把旧版本当成新变化。

source: The first successful check records the current baseline only; historical versions are not treated as new changes.
zh_hans: 首次成功检查只记录当前基线，不会把历史版本当成新变化。

source: The list contains %lld sources and will be merged into your current %lld: existing sources are not modified or deleted, and duplicate repos are skipped automatically. A check runs right after import.
zh_hans: 清单包含 %lld 个来源，将合并到现有的 %lld 个：已有来源不会被修改或删除，重复仓库自动跳过。导入后立即检查一轮。

source: The previously known upstream item no longer exists upstream, so new changes cannot be judged safely.
zh_hans: 上次已知的上游条目已不存在，无法安全判断新变化。

source: The theme only changes the accent color. A custom background replaces the page background; opacity, brightness and the readability shade are adjustable and can be turned off anytime. These preferences stay on this device and are never included in backups.
zh_hans: 主题只改变强调色。自定义背景会替换页面底色；透明度、亮度与可读性压暗都可调节，也可随时关闭。这些偏好仅保存在本机，不会包含在备份中。

source: The token is invalid or has been revoked. Check it and try again.
zh_hans: 令牌无效或已被撤销，请检查后重试。

source: The token is stored only in the local Keychain; it is never uploaded or written into exported backups, and you can revoke it anytime via “Sign Out” in Settings.
zh_hans: 令牌仅保存在本机 Keychain，不会上传，也不会写进导出备份；可随时在设置里“登出”撤销。

source: The upstream version matches the version you recorded.
zh_hans: 上游版本与你记录的使用版本一致。

source: The version you recorded is ahead of the upstream identifier (a development build, or a different numbering scheme). Check the original.
zh_hans: 你记录的使用版本高于上游标识（可能是开发版或不同编号方式），请核对原文。

source: Theme
zh_hans: 主题配色

source: This device does not support alternate app icons.
zh_hans: 此设备不支持备用 App 图标。

source: This info is only used locally to judge relevance; it is never sent to GitHub.
zh_hans: 这些信息只用于本地判断相关性，不会发给 GitHub。

source: Too many files in the repo; the list is incomplete. Enter the path manually.
zh_hans: 仓库文件过多，列表不完整；请手动输入路径。

source: Try another keyword, or clear the tag filter.
zh_hans: 换个关键词，或清除标签筛选。

source: Unauthenticated mode is limited to 60 requests/hour per IP; the search endpoint has a separate limit. Personal notes are never sent to GitHub.
zh_hans: 未登录模式每 IP 每小时 60 次；搜索接口独立限额。个人备注不会发给 GitHub。

source: Uncertain Impact
zh_hans: 影响不确定

source: Unknown
zh_hans: 未知

source: Unread
zh_hans: 未读

source: Upstream ID
zh_hans: 上游标识

source: Upstream Versions
zh_hans: 上游版本

source: Upstream latest is the pre-release {upstream}; you recorded {installed}. Whether to adopt a pre-release is your call.
zh_hans: 上游最新为预发布版本 {upstream}，你记录的使用版本是 {installed}；预发布是否采用请自行判断。

source: Upstream latest is {upstream}; you recorded {installed}. Only minor version steps (about {steps}).
zh_hans: 上游最新为 {upstream}，你记录的使用版本是 {installed}，仅小版本更新（约 {steps} 个版本号段）。

source: Upstream latest is {upstream}; you recorded {installed}. This spans about {steps} major version step(s); check compatibility.
zh_hans: 上游最新为 {upstream}，你记录的使用版本是 {installed}，包含主版本升级（约 {steps} 个版本号段），请核对兼容性。

source: UpstreamLens is an on-device tech-change radar: it monitors Release, Tag, and path commits of public GitHub repos and gives verifiable judgments based on your locally stored usage.
zh_hans: UpstreamLens 是本机使用的技术变化雷达：监控公开 GitHub 仓库的 Release、Tag 与指定路径的提交，结合本机保存的用途给出可核查的判断。

source: UpstreamLens only reads public info; a read-only token is enough. Grant permissions as needed:
zh_hans: UpstreamLens 只读取公开信息，给它一个只读令牌即可。按需授予权限：

source: UpstreamLens watches the GitHub repos you care about — Releases, Tags, and commits to specific files. When something changes you get a checkable signal, instead of refreshing pages.
zh_hans: UpstreamLens 盯着你在意的 GitHub 仓库——Release、Tag，以及指定文件的提交。有变化时给你一个可核查的信号，而不是让你反复刷页面。

source: Upstreams sometimes publish content-addressed snapshots as releases or tags, which carry no version meaning. Turning this on keeps only entries that look like version numbers. If nothing qualifies, everything is kept so the source never goes silent.
zh_hans: 上游有时会把内容寻址快照也做成 release 或 tag，这类条目没有版本含义。开启后只保留看起来像版本号的条目。若一条都不符合则全部保留，避免来源彻底不再提醒。

source: Usage
zh_hans: 使用情况

source: Usage (stored on this device only)
zh_hans: 使用情况（仅保存在本机）

source: Use Repo Description as Purpose
zh_hans: 使用仓库描述作为用途

source: Used to group and filter the Sources tab. Categories can be edited in Settings → Categories.
zh_hans: 用于来源页的分组与筛选。类别可在「设置 → 类别管理」中编辑。

source: Verification failed
zh_hans: 验证失败

source: Verified Quota
zh_hans: 已验证额度

source: Verifying…
zh_hans: 验证中…

source: Version
zh_hans: 版本
